export const sexList = [
  {
    value: 0,
    text: '男'
  },
  {
    value: 1,
    text: '女'
  }
]

export const bankList = [
  {
    text: '中国工商银行',
    value: 'ICBC'
  },
  {
    text: '中国建设银行',
    value: 'CCB'
  },
  {
    text: '中国农业银行',
    value: 'ABC'
  },
  {
    text: '中国银行',
    value: 'BOC'
  },
  {
    text: '中国招商银行',
    value: 'CMB'
  },
  {
    text: '中国交通银行',
    value: 'BOCOM'
  }
]

export const BankLocationList = [
  {
    text: '上海',
    value: '上海'
  },
  {
    text: '北京',
    value: '北京'
  },
  {
    text: '广东',
    value: '广东'
  },
  {
    text: '河北',
    value: '河北'
  },
  {
    text: '福建',
    value: '福建'
  },
  {
    text: '山东',
    value: '山东'
  },
  {
    text: '湖北',
    value: '湖北'
  },
  {
    text: '江苏',
    value: '江苏'
  },
  {
    text: '四川',
    value: '四川'
  },
  {
    text: '天津',
    value: '天津'
  }
]

export const payStyleList = [
  {
    src: require('components/infonmation/baidu.png'),
    p: '百度钱包',
    des: '',
    value: 'bd'
  },
  {
    src: require('components/infonmation/bank.png'),
    p: '银联支付',
    des: '（同续期银行卡）',
    value: 'yl'
  },
  {
    src: require('components/infonmation/weixin.png'),
    p: '微信支付',
    des: '',
    value: 'wx'
  },
  {
    src: require('components/infonmation/zfb.png'),
    p: '支付宝支付',
    des: '',
    value: 'zfb'
  }
]

export const title = {
  '/premium': '同方全球',
  '/planDes': '保障详情',
  '/healthy': '健康告知',
  '/infonmation': '保单填写'
}

export const goods = {
  TCIB07: {
    banner: {
      src: 'https://esales.aegonthtf.com/sylifetime/tybanner.png',
      title: '同佑e生重大疾病保产品计划',
      des: '30天-50周岁可投保',
      advantages: [
        '轻症不分组赔付三次并豁免保费',
        '100种重疾+50种轻症 身故赔付保额',
        '保费恒定 赠首年健康增值服务'
      ]
    },
    plan: [
      {
        lowest: '60',
        duration: '30年',
        value: 30,
        des: [
          {
            text: '重大疾病保险金',
            value: '基本保额'
          },
          {
            text: '轻症疾病保险金(最多3次)',
            value: '基本保额*20%'
          },
          {
            text: '身故保险金',
            value: '基本保额或已交保费'
          },
          {
            text: '轻症豁免保险费',
            value: '豁免剩余未交保费'
          },
          {
            text: '满期保险金(附加险)',
            value: '可选'
          }
        ],
        amountList: [
          [
            {
              text: '10万',
              value: '100000'
            },
            {
              text: '20万',
              value: '200000'
            },
            {
              text: '30万',
              value: '300000'
            },
            {
              text: '40万',
              value: '400000'
            },
            {
              text: '50万',
              value: '500000'
            }
          ]
        ]
      },
      {
        lowest: '220',
        duration: '保至70周岁',
        value: 70,
        des: [
          {
            text: '重大疾病保险金',
            value: '基本保额'
          },
          {
            text: '轻症疾病保险金(最多3次)',
            value: '基本保额*20%'
          },
          {
            text: '身故保险金',
            value: '基本保额或已交保费'
          },
          {
            text: '轻症豁免保险费',
            value: '豁免剩余未交保费'
          },
          {
            text: '满期保险金(附加险)',
            value: '可选'
          }
        ],
        amountList: [
          [
            {
              text: '10万',
              value: '100000'
            },
            {
              text: '20万',
              value: '200000'
            },
            {
              text: '30万',
              value: '300000'
            },
            {
              text: '40万',
              value: '400000'
            },
            {
              text: '50万',
              value: '500000'
            }
          ]
        ]
      },
      {
        lowest: '570',
        duration: '终身',
        value: 105,
        des: [
          {
            text: '重大疾病保险金',
            value: '基本保额'
          },
          {
            text: '轻症疾病保险金(最多3次)',
            value: '基本保额*20%'
          },
          {
            text: '身故保险金',
            value: '基本保额或已交保费'
          },
          {
            text: '轻症豁免保险费',
            value: '豁免剩余未交保费'
          },
          {
            text: '满期保险金(附加险)',
            value: '可选'
          }
        ],
        amountList: [
          [
            {
              text: '10万',
              value: '100000'
            },
            {
              text: '20万',
              value: '200000'
            },
            {
              text: '30万',
              value: '300000'
            },
            {
              text: '40万',
              value: '400000'
            },
            {
              text: '50万',
              value: '500000'
            }
          ]
        ]
      }
    ],
    introduction: 'https://esales.aegonthtf.com/sylifetime/tyimageL.jpg',
    planDes: [
      {
        duration: '10万保额',
        des: [
          {
            text: '重大疾病保险金',
            value: '10万',
            p: '100种重疾，意外伤害或等待期后可一次性赔付10万'
          },
          {
            text: '轻症疾病保险金(最多3次)',
            value: '2万',
            p: '50种轻症，不分组最多赔付3次，单次赔付2万'
          },
          {
            text: '身故保险金',
            value: '基本保额或已交保费',
            p: '18周岁前，赔付主险已交保费+附加险已交保费(可选)；18周岁后赔付10万+160%附加险已交保费(可选)'
          },
          {
            text: '轻症豁免保险费',
            value: '豁免剩余未交保险费',
            p: '交费期限内，被保险人首次确诊轻症，豁免后期应交保费，含附加险两全险（若有）'
          },
          {
            text: '满期保险金(附加险)',
            value: '可选',
            p: '保险期间至70周岁或终身可选择附加两全险。若被保险人在合同满期日的零时仍然生存，给付主附险100%已交保险费；保险期间为至70周岁满期日为70周岁，保险期间为终身满期日为80周岁'
          }
        ]
      },
      {
        duration: '20万保额',
        des: [
          {
            text: '重大疾病保险金',
            value: '20万',
            p: '100种重疾，意外伤害或等待期后可一次性赔付20万'
          },
          {
            text: '轻症疾病保险金(最多3次)',
            value: '4万',
            p: '50种轻症，不分组最多赔付3次，单次赔付4万'
          },
          {
            text: '身故保险金',
            value: '基本保额或已交保费',
            p: '18周岁前，赔付主险已交保费+附加险已交保费(可选)；18周岁后赔付20万+160%附加险已交保费(可选)'
          },
          {
            text: '轻症豁免保险费',
            value: '豁免剩余未交保险费',
            p: '交费期限内，被保险人首次确诊轻症，豁免后期应交保费，含附加险两全险（若有）'
          },
          {
            text: '满期保险金(附加险)',
            value: '可选',
            p: '保险期间至70周岁或终身可选择附加两全险。若被保险人在合同满期日的零时仍然生存，给付主附险100%已交保险费；保险期间为至70周岁满期日为70周岁，保险期间为终身满期日为80周岁'
          }
        ]
      },
      {
        duration: '30万保额',
        des: [
          {
            text: '重大疾病保险金',
            value: '30万',
            p: '100种重疾，意外伤害或等待期后可一次性赔付30万'
          },
          {
            text: '轻症疾病保险金(最多3次)',
            value: '6万',
            p: '50种轻症，不分组最多赔付3次，单次赔付6万'
          },
          {
            text: '身故保险金',
            value: '基本保额或已交保费',
            p: '18周岁前，赔付主险已交保费+附加险已交保费(可选)；18周岁后赔付30万+160%附加险已交保费(可选)'
          },
          {
            text: '轻症豁免保险费',
            value: '豁免剩余未交保险费',
            p: '交费期限内，被保险人首次确诊轻症，豁免后期应交保费，含附加险两全险（若有）'
          },
          {
            text: '满期保险金(附加险)',
            value: '可选',
            p: '保险期间至70周岁或终身可选择附加两全险。若被保险人在合同满期日的零时仍然生存，给付主附险100%已交保险费；保险期间为至70周岁满期日为70周岁，保险期间为终身满期日为80周岁'
          }
        ]
      },
      {
        duration: '40万保额',
        des: [
          {
            text: '重大疾病保险金',
            value: '40万',
            p: '100种重疾，意外伤害或等待期后可一次性赔付40万'
          },
          {
            text: '轻症疾病保险金(最多3次)',
            value: '8万',
            p: '50种轻症，不分组最多赔付3次，单次赔付8万'
          },
          {
            text: '身故保险金',
            value: '基本保额或已交保费',
            p: '18周岁前，赔付主险已交保费+附加险已交保费(可选)；18周岁后赔付10万+160%附加险已交保费(可选)'
          },
          {
            text: '轻症豁免保险费',
            value: '豁免剩余未交保险费',
            p: '交费期限内，被保险人首次确诊轻症，豁免后期应交保费，含附加险两全险（若有）'
          },
          {
            text: '满期保险金(附加险)',
            value: '可选',
            p: '保险期间至70周岁或终身可选择附加两全险。若被保险人在合同满期日的零时仍然生存，给付主附险100%已交保险费；保险期间为至70周岁满期日为70周岁，保险期间为终身满期日为80周岁'
          }
        ]
      },
      {
        duration: '50万保额',
        des: [
          {
            text: '重大疾病保险金',
            value: '50万',
            p: '100种重疾，意外伤害或等待期后可一次性赔付50万'
          },
          {
            text: '轻症疾病保险金(最多3次)',
            value: '10万',
            p: '50种轻症，不分组最多赔付3次，单次赔付10万'
          },
          {
            text: '身故保险金',
            value: '基本保额或已交保费',
            p: '18周岁前，赔付主险已交保费+附加险已交保费(可选)；18周岁后赔付50万+160%附加险已交保费(可选)'
          },
          {
            text: '轻症豁免保险费',
            value: '豁免剩余未交保险费',
            p: '交费期限内，被保险人首次确诊轻症，豁免后期应交保费，含附加险两全险（若有）'
          },
          {
            text: '满期保险金(附加险)',
            value: '可选',
            p: '保险期间至70周岁或终身可选择附加两全险。若被保险人在合同满期日的零时仍然生存，给付主附险100%已交保险费；保险期间为至70周岁满期日为70周岁，保险期间为终身满期日为80周岁'
          }
        ]
      }
    ],
    healthy: [
      '1.  您是否被保险公司解除合同或投保、复效时被拒保、延期、附加条件承保或有过癌症或重大疾病的索赔？',
      '2.  您在过去2年内是否做过X光、B超、彩超、CT、核磁共振、内窥镜、病理活检、眼底检查、血液检查、宫颈涂片检查或其他检查并且检查结果有异常？',
      '3.  您在过去5年内是否曾经住院？是否接受过医师的住院或手术建议？',
      '4.  您是否曾经患有、被告知患有或正在患有下列疾病或症状？',
      '（1） 癌症、良性或恶性肿瘤、息肉、囊肿、赘生物、结节、黑痣增大、淋巴结肿大、结石、任何包块或肿物。',
      '（2） 在过去一年内是否有反复头痛、胸痛、咳血、气喘、肝区不适、腹痛、血尿、便血、紫瘢等情况？是否有体重减轻超过5公斤（非健身或减肥原因）？',
      '（3） 高血压（未在服降压药的情况下，血压的收缩压≥140mmHg或舒张压≥90mmHg、心脏疾病、冠心病、心肌病、心内膜炎、心律失常、剧烈头痛、晕厥、胸闷、胸痛、心悸、气急、不能平卧、紫绀。',
      '（4） 肝炎、乙肝或丙肝病毒携带、肝硬化、胆道感染、胰腺疾病、消化道溃疡、萎缩性胃炎、咯血、反复呕吐、进食梗噎感或吞咽困难、呕血、浮肿、腹痛、肝区疼痛、黄疸、便血、排便习惯或大便性状改变。',
      '（5） 糖尿病、肾脏疾病、肾上腺疾病、甲状腺或甲状旁腺疾病、痛风、红斑狼疮、风湿或类风湿、肌肉骨骼关节疾病、血尿、蛋白尿、关节红肿、关节酸痛。',
      '（6） 癫痫、脑中风、短暂性脑缺血、脑炎、脑膜炎、帕金森氏病、脑外伤后综合症、脊髓病变、多发性硬化、精神疾病。',
      '（7） 贫血、血小板减少性紫癜、过敏性紫癜、淋巴瘤、骨髓瘤、白血病、血友病、不明原因皮下出血点、鼻衄、反复齿龈出血。',
      '（8） 白内障、青光眼、高度近视（800度以上）、视神经或视网膜病变。',
      '（9） 先天性疾病、遗传性疾病。',
      '（10） 残疾、智能障碍、言语、咀嚼、视力、听力等机能障碍。',
      '（11） 性传播疾病、艾滋病、成瘾性药品或毒品接触史。',
      '（12） 2周岁以下儿童（含2周岁）请回答：是否为早产、出生体重是否低于2公斤，是否有先天的损伤？出生时曾有难产、产伤、窒息、缺氧等异常情况？发育迟缓、惊厥、抽搐、脑瘫、先天性疾病、遗传性疾病？是否曾因此接受治疗？或因疾病延长新生儿住院时间或迟于母亲出院？',
      '5.投保人适用：您是否是美国护照持有人、美国绿卡持有人、美国居民或每年于美国居住达183 日以上？'
    ]
  }
}

export const number = 'TCIB07'

